/*
Даны два указателя по тем же правилам, что и в пред. задаче.
Выведите сумму переменных, на которые ссылаются данные указатели.
P.S. Полный исходный код задачи доступен на форуме для решивших задачу.
*/

printf("%d", *p_2 + *p_1);